spec/fixtures/soap/send_message/incorrect_auth_data/request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://mcommunicator.ru/M2M" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://mcommunicator.ru/M2M" xmlns:ins1="http://mcommunicator.ru/M2M/AbstractTypes"><env:Body><ins0:SendMessage><ins0:login xsi:nil="true"/><ins0:password xsi:nil="true"/><ins0:msid>79222222222</ins0:msid><ins0:message>test</ins0:message><ins0:naming>79857707575</ins0:naming></ins0:SendMessage></env:Body></env:Envelope>